In [2]:
import pandas as pd
import numpy as np

In [7]:
l=['a','b','c']
d=[1,2,3]
arr=np.array(d)
dic={'a':1,'b':2,'c':3}

In [8]:
pd.Series(data=d)

0    1
1    2
2    3
dtype: int64

In [11]:
pd.Series(data=d,index=l)

a    1
b    2
c    3
dtype: int64

In [12]:
pd.Series(arr)

0    1
1    2
2    3
dtype: int32

In [13]:
pd.Series(arr,l)

a    1
b    2
c    3
dtype: int32

In [15]:
pd.Series(dic)

a    1
b    2
c    3
dtype: int64

In [16]:
ser1=pd.Series(np.arange(5),['India','USA','Russia','SA','UK'])

In [17]:
ser1

India     0
USA       1
Russia    2
SA        3
UK        4
dtype: int32

In [21]:
ser1['UK']

4

In [22]:
ser2=pd.Series(np.arange(2,7),['India','Canada','Russia','Italy','UK'])

In [23]:
ser2

India     2
Canada    3
Russia    4
Italy     5
UK        6
dtype: int32

In [24]:
ser1+ser2

Canada     NaN
India      2.0
Italy      NaN
Russia     6.0
SA         NaN
UK        10.0
USA        NaN
dtype: float64

# DATA FRAMES

In [25]:
import numpy as np
import pandas as pd

In [26]:
from numpy.random import randn

In [27]:
np.random.seed(101)

In [28]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
type(df['W'])

pandas.core.series.Series

In [33]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df.W #not recommended

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [36]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [37]:
df['new']=df['W']+df['Y']

In [38]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [41]:
df.drop('new',axis=1,inplace=False)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [42]:
df.drop('E',axis=0)

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [44]:
df.loc['E']

W      0.190794
X      1.978757
Y      2.605967
Z      0.683509
new    2.796762
Name: E, dtype: float64

In [46]:
df.iloc[4]

W      0.190794
X      1.978757
Y      2.605967
Z      0.683509
new    2.796762
Name: E, dtype: float64

In [47]:
df.loc['B','Y']

-0.8480769834036315

In [48]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [49]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# DF2

In [50]:
df>0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True  False
C  False   True   True  False  False
D   True  False  False   True  False
E   True   True   True   True   True

In [51]:
df[df>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [52]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [53]:
df[df['W']>0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [56]:
df[df['Z']<0]

          W         X         Y         Z       new
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

In [57]:
df[df['Z']<0]['X']

C    0.740122
Name: X, dtype: float64

In [60]:
df[(df['Z']<0) & (df['Y']>0)]

          W         X         Y         Z       new
C -2.018168  0.740122  0.528813 -0.589001 -1.489355

In [61]:
df[(df['Z']<0) | (df['Y']>0)]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [62]:
dfcopy=df.copy()

In [63]:
dfcopy

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [66]:
dfcopy.reset_index(inplace=True)

In [67]:
dfcopy

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [68]:
newind='CA NY WY OR CO'.split()

In [70]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [71]:
df['States']=newind

In [72]:
df

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  3.614819     CA
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959     NY
C -2.018168  0.740122  0.528813 -0.589001 -1.489355     WY
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542     OR
E  0.190794  1.978757  2.605967  0.683509  2.796762     CO

In [74]:
dfcopy['States']=newind

In [75]:
dfcopy.set_index('States')

       index         W         X         Y         Z       new
States
CA         A  2.706850  0.628133  0.907969  0.503826  3.614819
NY         B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
WY         C -2.018168  0.740122  0.528813 -0.589001 -1.489355
OR         D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
CO         E  0.190794  1.978757  2.605967  0.683509  2.796762

# DF3

In [91]:
#iNDEX LEVELS
outside=['G1','G1','G1','G2','G2','G2','G3']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [92]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [93]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [94]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [98]:
df.loc['G1',1]

A   -0.497104
B   -0.754070
Name: (G1, 1), dtype: float64

In [99]:
df.loc['G1','A']

1   -0.497104
2   -0.943406
3   -0.116773
Name: A, dtype: float64

In [100]:
df.index.names

FrozenList([None, None])

In [101]:
df.index.names=['Groups','Num']

In [102]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [103]:
df.loc['G2']

            A         B
Num
1    0.238127  1.996652
2   -0.993263  0.196800
3   -1.136645  0.000366

In [106]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [110]:
df.loc['G2',2]['B']

0.19679950499134005

In [112]:
df.xs('G1')

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [113]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

# Missing Data

In [114]:
d1={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [115]:
df=pd.DataFrame(d1)

In [116]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [117]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [118]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [120]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [121]:
df.fillna(value='gibgib')

        A       B  C
0       1       5  1
1       2  gibgib  2
2  gibgib  gibgib  3

In [122]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [123]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [126]:
data={'Company':['Google','Google','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vanesa','Carl','Sarah'],
      'Sales':[200,120,340,124,243,350]
}

In [127]:
df=pd.DataFrame(data)

In [128]:
df

  Company   Person  Sales
0  Google      Sam    200
1  Google  Charlie    120
2    MSFT      Amy    340
3    MSFT   Vanesa    124
4      FB     Carl    243
5      FB    Sarah    350

In [131]:
ByComp=df.groupby('Company')

In [133]:
ByComp.mean()

         Sales
Company
FB       296.5
Google   160.0
MSFT     232.0

In [134]:
ByComp.sum()

         Sales
Company
FB         593
Google     320
MSFT       464

In [136]:
ByComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [138]:
df.groupby('Company').describe().transpose()

Company              FB      Google        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [1]:
data1={
    'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}

In [3]:
df=pd.DataFrame(data1)

In [4]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [5]:
df.pivot(index=['A','B'], columns='C', values='D')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN